module Guide_5 (
) where

-- Ejercicio Extra 1

-- Dar interpretación CBN para: (λx. x) ((λy. if y then ff else tt) tt)

--                                                                                         -------- TT
--                                                                                         ø ⊢ tt ↪ tt
--                                                                                         --------------------    ------------------ FF
--                                                                                         y = ⟨tt, ø⟩ ⊢ y ↪ tt    y = ⟨tt, ø⟩ ⊢ ff ↪ ff
--                          ------------------------------------------------------- ABS    ----------------------------------------- IF
--                          ø ⊢ λy. if y then ff else tt ↪ ⟨y, if y then ff else tt, ø⟩    y = ⟨tt, ø⟩ ⊢ if y then ff else tt ↪ ff
--                          --------------------------------------------------------------------------------------------------- MN
--                          ø ⊢ (λy. if y then ff else tt) tt ↪ ff
-------------------- ABS    -------------------------------------------- MN
-- ø ⊢ λx. x ↪ ⟨x, x, ø⟩    x = ⟨(λy. if y then ff else tt) tt, ø⟩ ⊢ x ↪ ff
------------------------------------------------------------------------ MN
-- ø ⊢ (λx. x) ((λy. if y then ff else tt) tt) ↪ ff


-- Dar interpretación CBV para: (λx. x) ((λy. if y then ff else tt) tt)

--                                                                                                                            ------------ TT    ------------- FF
--                                                                                                                            y = tt ⊢ y ↪ tt    y = tt ⊢ ff ↪ ff
--                                              -------- TT    ------------------------------------------------------- ABS    -------------------------------- IF
--                                              ø ⊢ tt ↪ tt    ø ⊢ λy. if y then ff else tt ↪ ⟨y, if y then ff else tt, ø⟩    y = tt ⊢ if y then ff else tt ↪ ff
-------------------- ABS    ------------- FF    ------------------------------------------------------------------------------------------------------------- MN
-- ø ⊢ λx. x ↪ ⟨x, x, ø⟩    x = ff ⊢ x ↪ ff     ø ⊢ (λy. if y then ff else tt) tt ↪ ff
----------------------------------------------------------------------------------- MN
-- ø ⊢ (λx. x) ((λy. if y then ff else tt) tt) ↪ ff


-- Ejercicio 1

-- Evaluar en el intérprete CBN

-- i. (λx.x) zero

------------------- ABS    ---------------------- Z
-- ø ⊢ λx.x ↪ ⟨x, x, ø⟩    x = ⟨zero, ø⟩ ⊢ x ↪ zero
------------------------------------------------ MN
-- ø ⊢ (λx.x) zero ↪ zero


-- ii. (λx.λx.x) 2 3

-- ø ⊢ λx.λx.x ↪ ⟨x, λx.x, ø⟩    x = ⟨2, ø⟩ ⊢ λx.x ↪ ⟨x, x, ø⟩
----------------------------------------------------------- MN    ---------------------------------- ABS
-- ø ⊢ (λx.λx.x) 2 ↪ ⟨x, λx.x, ø⟩                                 x = ⟨3, ø⟩ ⊢ λx.x ↪ ⟨x, x, x = ⟨3, ø⟩⟩
----------------------------------------------------------------------------------------------------- MN
-- ø ⊢ (λx.λx.x) 2 3 ↪ V


-- iii. (λx.λy.(λx.if isZero(x) then y else x) x) 5 4


-- iv. (λx.(λf.(λy.f 6) 5) (λy.if isZero(y) then x else y)) 4